In [1]:
import numpy as np
import pandas as pd

Series : A one-dimensional labeled array holding data of any type
DataFrame: A two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns

In [2]:
s= pd.Series([1,3,5,np.nan,6,9])

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))

In [5]:
df

                   A         B         C         D
2013-01-01  0.570807 -0.485628 -0.959673 -0.444487
2013-01-02 -0.105336  1.572108 -0.296082  0.919870
2013-01-03  0.010655 -1.410972 -1.136803 -0.917999
2013-01-04 -0.589981 -1.009157  1.154498 -0.627402
2013-01-05  1.755403  1.983366 -1.470727  0.105632
2013-01-06  0.085753  1.126516  0.434927 -0.428521

In [103]:
df.head()

       A  B    C         D         E
0    one  A  foo -0.299426 -1.354694
1    one  B  foo  1.937269  0.578697
2    two  C  foo -0.400318  0.945432
3  three  A  bar -0.563323 -0.810218
4    one  B  bar  0.126554 -0.451542

In [6]:
df2 = pd.DataFrame(
    {
        "A":5.00,
        "B":pd.Timestamp("20130102"), 
        "C":pd.Series(1,index=list(range(4)), dtype = "float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"Hi"
    }
)
df2

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [7]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
df2.head()

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [9]:
df.tail(2)

                   A         B         C         D
2013-01-05  1.755403  1.983366 -1.470727  0.105632
2013-01-06  0.085753  1.126516  0.434927 -0.428521

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.to_numpy()

array([[ 0.57080655, -0.4856285 , -0.95967258, -0.44448706],
       [-0.10533575,  1.5721076 , -0.29608167,  0.91986967],
       [ 0.01065529, -1.41097187, -1.13680328, -0.91799899],
       [-0.58998088, -1.00915739,  1.15449803, -0.62740179],
       [ 1.7554031 ,  1.98336582, -1.47072749,  0.10563152],
       [ 0.08575317,  1.12651609,  0.4349272 , -0.42852123]])

In [12]:
df2.to_numpy()

array([[5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi']],
      dtype=object)

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.570807   -0.105336    0.010655   -0.589981    1.755403    0.085753
B   -0.485628    1.572108   -1.410972   -1.009157    1.983366    1.126516
C   -0.959673   -0.296082   -1.136803    1.154498   -1.470727    0.434927
D   -0.444487    0.919870   -0.917999   -0.627402    0.105632   -0.428521

In [14]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-03  0.010655 -1.410972 -1.136803 -0.917999
2013-01-04 -0.589981 -1.009157  1.154498 -0.627402
2013-01-01  0.570807 -0.485628 -0.959673 -0.444487
2013-01-06  0.085753  1.126516  0.434927 -0.428521
2013-01-02 -0.105336  1.572108 -0.296082  0.919870
2013-01-05  1.755403  1.983366 -1.470727  0.105632

In [15]:
df["A"]

2013-01-01    0.570807
2013-01-02   -0.105336
2013-01-03    0.010655
2013-01-04   -0.589981
2013-01-05    1.755403
2013-01-06    0.085753
Freq: D, Name: A, dtype: float64

In [16]:
df[0:1]

                   A         B         C         D
2013-01-01  0.570807 -0.485628 -0.959673 -0.444487

In [17]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  0.570807 -0.485628
2013-01-02 -0.105336  1.572108
2013-01-03  0.010655 -1.410972
2013-01-04 -0.589981 -1.009157
2013-01-05  1.755403  1.983366
2013-01-06  0.085753  1.126516

In [18]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [19]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.loc["20130102":"20130103"]
print(df)

                   A         B         C         D
2013-01-01  0.570807 -0.485628 -0.959673 -0.444487
2013-01-02 -0.105336  1.572108 -0.296082  0.919870
2013-01-03  0.010655 -1.410972 -1.136803 -0.917999
2013-01-04 -0.589981 -1.009157  1.154498 -0.627402
2013-01-05  1.755403  1.983366 -1.470727  0.105632
2013-01-06  0.085753  1.126516  0.434927 -0.428521

Selection by Location of Label

In [21]:
df.loc[dates[0],"A"]

np.float64(0.5708065471278087)

In [22]:
df.at[dates[0],"A"]

np.float64(0.5708065471278087)

Selection by Position || .iloc means selecting by integer based location ,, not by actual index

In [23]:
df.iloc[3]

A   -0.589981
B   -1.009157
C    1.154498
D   -0.627402
Name: 2013-01-04 00:00:00, dtype: float64

In [24]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.589981 -1.009157
2013-01-05  1.755403  1.983366

In [25]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.105336 -0.296082
2013-01-03  0.010655 -1.136803
2013-01-05  1.755403 -1.470727

In [26]:
df.iloc[1:3,]

                   A         B         C         D
2013-01-02 -0.105336  1.572108 -0.296082  0.919870
2013-01-03  0.010655 -1.410972 -1.136803 -0.917999

In [27]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.485628 -0.959673
2013-01-02  1.572108 -0.296082
2013-01-03 -1.410972 -1.136803
2013-01-04 -1.009157  1.154498
2013-01-05  1.983366 -1.470727
2013-01-06  1.126516  0.434927

In [28]:
df.iloc[1,1]

np.float64(1.5721076028337704)

In [29]:
df

                   A         B         C         D
2013-01-01  0.570807 -0.485628 -0.959673 -0.444487
2013-01-02 -0.105336  1.572108 -0.296082  0.919870
2013-01-03  0.010655 -1.410972 -1.136803 -0.917999
2013-01-04 -0.589981 -1.009157  1.154498 -0.627402
2013-01-05  1.755403  1.983366 -1.470727  0.105632
2013-01-06  0.085753  1.126516  0.434927 -0.428521

Boolean Indexing

In [30]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  0.570807 -0.485628 -0.959673 -0.444487
2013-01-03  0.010655 -1.410972 -1.136803 -0.917999
2013-01-05  1.755403  1.983366 -1.470727  0.105632
2013-01-06  0.085753  1.126516  0.434927 -0.428521

In [31]:
df[df>0]

                   A         B         C         D
2013-01-01  0.570807       NaN       NaN       NaN
2013-01-02       NaN  1.572108       NaN  0.919870
2013-01-03  0.010655       NaN       NaN       NaN
2013-01-04       NaN       NaN  1.154498       NaN
2013-01-05  1.755403  1.983366       NaN  0.105632
2013-01-06  0.085753  1.126516  0.434927       NaN

In [32]:
df2 = df.copy()

In [33]:
df2["E"] = ["one","one","two","three","four","three"]

In [34]:
df2

                   A         B         C         D      E
2013-01-01  0.570807 -0.485628 -0.959673 -0.444487    one
2013-01-02 -0.105336  1.572108 -0.296082  0.919870    one
2013-01-03  0.010655 -1.410972 -1.136803 -0.917999    two
2013-01-04 -0.589981 -1.009157  1.154498 -0.627402  three
2013-01-05  1.755403  1.983366 -1.470727  0.105632   four
2013-01-06  0.085753  1.126516  0.434927 -0.428521  three

Setting

In [35]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range("20130102",periods=6))

In [36]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [37]:
df["F"]=s1

In [38]:
df.at[dates[0],"A"]=0

In [39]:
df.iat[0,1]=0

df.at(row_label, column_label) is used with labels... df.iat(row_index, column_index) is used with row and column integer index starting from

In [40]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.959673 -0.444487  NaN
2013-01-02 -0.105336  1.572108 -0.296082  0.919870  1.0
2013-01-03  0.010655 -1.410972 -1.136803 -0.917999  2.0
2013-01-04 -0.589981 -1.009157  1.154498 -0.627402  3.0
2013-01-05  1.755403  1.983366 -1.470727  0.105632  4.0
2013-01-06  0.085753  1.126516  0.434927 -0.428521  5.0

In [41]:
df.loc[:,"D"]=np.array([5]*len(df))

In [42]:
len(df)

6

In [43]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.959673  5.0  NaN
2013-01-02 -0.105336  1.572108 -0.296082  5.0  1.0
2013-01-03  0.010655 -1.410972 -1.136803  5.0  2.0
2013-01-04 -0.589981 -1.009157  1.154498  5.0  3.0
2013-01-05  1.755403  1.983366 -1.470727  5.0  4.0
2013-01-06  0.085753  1.126516  0.434927  5.0  5.0

In [44]:
df2 = df.copy()

In [45]:
df2[df2>0]= -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.959673 -5.0  NaN
2013-01-02 -0.105336 -1.572108 -0.296082 -5.0 -1.0
2013-01-03 -0.010655 -1.410972 -1.136803 -5.0 -2.0
2013-01-04 -0.589981 -1.009157 -1.154498 -5.0 -3.0
2013-01-05 -1.755403 -1.983366 -1.470727 -5.0 -4.0
2013-01-06 -0.085753 -1.126516 -0.434927 -5.0 -5.0

Missing Data

In [46]:
df1 = df.reindex(index=dates[0:4], columns =list(df.columns)+["E"])
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000 -0.959673  5.0  NaN NaN
2013-01-02 -0.105336  1.572108 -0.296082  5.0  1.0 NaN
2013-01-03  0.010655 -1.410972 -1.136803  5.0  2.0 NaN
2013-01-04 -0.589981 -1.009157  1.154498  5.0  3.0 NaN

In [47]:
df1.loc[dates[0]: dates[1],"E"]=1

In [48]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.959673  5.0  NaN  1.0
2013-01-02 -0.105336  1.572108 -0.296082  5.0  1.0  1.0
2013-01-03  0.010655 -1.410972 -1.136803  5.0  2.0  NaN
2013-01-04 -0.589981 -1.009157  1.154498  5.0  3.0  NaN

Drop Missing Values

In [49]:
df1.dropna(how="any", axis=1)
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.959673  5.0  NaN  1.0
2013-01-02 -0.105336  1.572108 -0.296082  5.0  1.0  1.0
2013-01-03  0.010655 -1.410972 -1.136803  5.0  2.0  NaN
2013-01-04 -0.589981 -1.009157  1.154498  5.0  3.0  NaN

In [50]:
p=df1.dropna(how="all", axis=1)

In [51]:
p

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.959673  5.0  NaN  1.0
2013-01-02 -0.105336  1.572108 -0.296082  5.0  1.0  1.0
2013-01-03  0.010655 -1.410972 -1.136803  5.0  2.0  NaN
2013-01-04 -0.589981 -1.009157  1.154498  5.0  3.0  NaN

In [52]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.959673  5.0  NaN
2013-01-02 -0.105336  1.572108 -0.296082  5.0  1.0
2013-01-03  0.010655 -1.410972 -1.136803  5.0  2.0
2013-01-04 -0.589981 -1.009157  1.154498  5.0  3.0
2013-01-05  1.755403  1.983366 -1.470727  5.0  4.0
2013-01-06  0.085753  1.126516  0.434927  5.0  5.0

In [53]:
df3 = df.copy()

In [54]:
df3

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.959673  5.0  NaN
2013-01-02 -0.105336  1.572108 -0.296082  5.0  1.0
2013-01-03  0.010655 -1.410972 -1.136803  5.0  2.0
2013-01-04 -0.589981 -1.009157  1.154498  5.0  3.0
2013-01-05  1.755403  1.983366 -1.470727  5.0  4.0
2013-01-06  0.085753  1.126516  0.434927  5.0  5.0

While using df.dropna function ,,, axis= 0 to remove row , 1 to remove column ... how="any" removes row/column if there is any missing value in the row/column .............. how = "all" removes the row./column only if all the value in the row or column are NaN

In [55]:
df5 = df3.dropna(axis=1, how="any")
df5

                   A         B         C    D
2013-01-01  0.000000  0.000000 -0.959673  5.0
2013-01-02 -0.105336  1.572108 -0.296082  5.0
2013-01-03  0.010655 -1.410972 -1.136803  5.0
2013-01-04 -0.589981 -1.009157  1.154498  5.0
2013-01-05  1.755403  1.983366 -1.470727  5.0
2013-01-06  0.085753  1.126516  0.434927  5.0

Operations

In [56]:
df.rename(columns={"F":"E"},inplace=True)
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000 -0.959673  5.0  NaN
2013-01-02 -0.105336  1.572108 -0.296082  5.0  1.0
2013-01-03  0.010655 -1.410972 -1.136803  5.0  2.0
2013-01-04 -0.589981 -1.009157  1.154498  5.0  3.0
2013-01-05  1.755403  1.983366 -1.470727  5.0  4.0
2013-01-06  0.085753  1.126516  0.434927  5.0  5.0

In [57]:
df.mean()

A    0.192749
B    0.376977
C   -0.378977
D    5.000000
E    3.000000
dtype: float64

In [58]:
df.mean(axis=0)

A    0.192749
B    0.376977
C   -0.378977
D    5.000000
E    3.000000
dtype: float64

In [59]:
df.mean(axis=1)

2013-01-01    1.010082
2013-01-02    1.434138
2013-01-03    0.892576
2013-01-04    1.511072
2013-01-05    2.253608
2013-01-06    2.329439
Freq: D, dtype: float64

In [60]:
s= pd.Series([1,2,5,np.nan,6,8],index=dates).shift(2)

In [61]:
df,s

(                   A         B         C    D    E
 2013-01-01  0.000000  0.000000 -0.959673  5.0  NaN
 2013-01-02 -0.105336  1.572108 -0.296082  5.0  1.0
 2013-01-03  0.010655 -1.410972 -1.136803  5.0  2.0
 2013-01-04 -0.589981 -1.009157  1.154498  5.0  3.0
 2013-01-05  1.755403  1.983366 -1.470727  5.0  4.0
 2013-01-06  0.085753  1.126516  0.434927  5.0  5.0,
 2013-01-01    NaN
 2013-01-02    NaN
 2013-01-03    1.0
 2013-01-04    2.0
 2013-01-05    5.0
 2013-01-06    NaN
 Freq: D, dtype: float64)

In [62]:
df.sub(s,axis="index")

                   A         B         C    D    E
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.989345 -2.410972 -2.136803  4.0  1.0
2013-01-04 -2.589981 -3.009157 -0.845502  3.0  1.0
2013-01-05 -3.244597 -3.016634 -6.470727  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

User Defined Functions

.agg() is used to perform a column wise operation in the dataframe,, where each column as pandas series is operated.. to operate in row, we can use axis=1

In [63]:
df.agg(lambda x: np.mean(x)*2)

A     0.385498
B     0.753953
C    -0.757953
D    10.000000
E     6.000000
dtype: float64

In [64]:
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000 -0.959673  5.0  NaN
2013-01-02 -0.105336  1.572108 -0.296082  5.0  1.0
2013-01-03  0.010655 -1.410972 -1.136803  5.0  2.0
2013-01-04 -0.589981 -1.009157  1.154498  5.0  3.0
2013-01-05  1.755403  1.983366 -1.470727  5.0  4.0
2013-01-06  0.085753  1.126516  0.434927  5.0  5.0

df.transform() applies a function to each element preserving the shape of the dataframe

In [65]:
df.transform(lambda x:x*100)

                     A           B           C      D      E
2013-01-01    0.000000    0.000000  -95.967258  500.0    NaN
2013-01-02  -10.533575  157.210760  -29.608167  500.0  100.0
2013-01-03    1.065529 -141.097187 -113.680328  500.0  200.0
2013-01-04  -58.998088 -100.915739  115.449803  500.0  300.0
2013-01-05  175.540310  198.336582 -147.072749  500.0  400.0
2013-01-06    8.575317  112.651609   43.492720  500.0  500.0

Value Counts

In [66]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    6
1    5
2    4
3    6
4    2
5    5
6    6
7    5
8    4
9    5
dtype: int32

In [67]:
s.value_counts()

5    4
6    3
4    2
2    1
Name: count, dtype: int64

String Methods

In [68]:
s=pd.Series(["A","B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])

In [69]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [70]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [71]:
df = pd.DataFrame(np.random.randn(10,4))

In [72]:
df

          0         1         2         3
0 -0.995074 -1.292124  1.212731  1.146893
1 -0.248733 -0.128189  0.875929  1.118807
2 -0.917828  0.158238  0.540949 -1.662286
3 -1.647204 -0.949943  1.532779 -0.845455
4 -0.666885 -0.282538 -0.277153  0.178399
5 -0.905553  1.197249  0.441215 -1.608615
6  0.612744 -1.154485 -1.611259  0.442820
7  0.644213 -0.786759  0.463183 -0.772211
8  1.673709 -0.399073 -1.524629  0.017834
9 -0.543833  1.674526 -0.737388 -0.115352

Breaking into Pieces

In [73]:
pieces = [df[:3],df[3:7],df[7:]]

In [74]:
pieces

[          0         1         2         3
 0 -0.995074 -1.292124  1.212731  1.146893
 1 -0.248733 -0.128189  0.875929  1.118807
 2 -0.917828  0.158238  0.540949 -1.662286,
           0         1         2         3
 3 -1.647204 -0.949943  1.532779 -0.845455
 4 -0.666885 -0.282538 -0.277153  0.178399
 5 -0.905553  1.197249  0.441215 -1.608615
 6  0.612744 -1.154485 -1.611259  0.442820,
           0         1         2         3
 7  0.644213 -0.786759  0.463183 -0.772211
 8  1.673709 -0.399073 -1.524629  0.017834
 9 -0.543833  1.674526 -0.737388 -0.115352]

In [75]:
pd.concat(pieces)

          0         1         2         3
0 -0.995074 -1.292124  1.212731  1.146893
1 -0.248733 -0.128189  0.875929  1.118807
2 -0.917828  0.158238  0.540949 -1.662286
3 -1.647204 -0.949943  1.532779 -0.845455
4 -0.666885 -0.282538 -0.277153  0.178399
5 -0.905553  1.197249  0.441215 -1.608615
6  0.612744 -1.154485 -1.611259  0.442820
7  0.644213 -0.786759  0.463183 -0.772211
8  1.673709 -0.399073 -1.524629  0.017834
9 -0.543833  1.674526 -0.737388 -0.115352

https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=records%20to%20it.-,Join,-%23

Join

In [76]:
left = pd.DataFrame({"key":["foo","foo"],"Ival":[1,2]})
left

   key  Ival
0  foo     1
1  foo     2

In [77]:
right = pd.DataFrame({"key":["foo","foo"],"rval":[4,5]})
right

   key  rval
0  foo     4
1  foo     5

In [78]:
pd.merge(left,right,on="key")

   key  Ival  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [79]:
left = pd.DataFrame({"key":["foo","zoo"],"Ival":[1,2]})
right = pd.DataFrame({"key":["foo","zoo"],"Jval":[4,5]})
pd.merge(left,right,on="key")

   key  Ival  Jval
0  foo     1     4
1  zoo     2     5

Grouping

In [80]:
df = pd.DataFrame(
    {
        "A":["foo","bar","foo","bar","foo","bar","foo","bar"],
        "B":["one","one","two","three","two","two","one","one"],
        "C":np.random.randn(8),
        "D":np.random.randn(8)
    }
)

In [81]:
df

     A      B         C         D
0  foo    one  2.129354 -1.980461
1  bar    one  0.487207 -0.648977
2  foo    two  1.422794  0.003183
3  bar  three  0.734959 -1.250855
4  foo    two  0.419825  0.407773
5  bar    two  0.260411 -0.775774
6  foo    one  0.571717 -1.325152
7  bar    one -0.251733  2.420389

[2082/05/07 09:55 PM](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=a%20column%20label%2C%20selecting)

In [82]:
df.groupby("A")[["C","D"]].sum()

            C         D
A
bar  1.230845 -0.255217
foo  4.543691 -2.894657

2081/05/08    08:09 PM ...... August 24, 2025

In [83]:
df.groupby("A")[["C"]].sum()

            C
A
bar  1.230845
foo  4.543691

In [84]:
df.groupby("B").sum()

                  A         C         D
B
one    foobarfoobar  2.936546 -1.534201
three           bar  0.734959 -1.250855
two       foofoobar  2.103031 -0.364818

2082/05/13  08:10 PM, @ Tinkune

In [85]:
df

     A      B         C         D
0  foo    one  2.129354 -1.980461
1  bar    one  0.487207 -0.648977
2  foo    two  1.422794  0.003183
3  bar  three  0.734959 -1.250855
4  foo    two  0.419825  0.407773
5  bar    two  0.260411 -0.775774
6  foo    one  0.571717 -1.325152
7  bar    one -0.251733  2.420389

In [86]:
df.groupby(["A"]).sum()

                  B         C         D
A
bar  onethreetwoone  1.230845 -0.255217
foo    onetwotwoone  4.543691 -2.894657

Reshaping

In [87]:
arrays = [["bar","bar","baz","baz","foo","foo","qux","qux"],
["one","two","one","two","one","two","one","two"]]

In [88]:
index = pd.MultiIndex.from_arrays(arrays, names=["first","second"])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=["A","B"])

In [89]:
df

                     A         B
first second
bar   one    -1.004370  0.268842
      two    -0.691180  1.214667
baz   one    -0.993243 -0.568194
      two     0.132516 -0.053006
foo   one     0.954278 -0.295607
      two    -0.003812  0.398138
qux   one    -0.657219 -0.465583
      two    -0.554222  0.506220

In [90]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -1.004370  0.268842
      two    -0.691180  1.214667
baz   one    -0.993243 -0.568194
      two     0.132516 -0.053006

In pandas, df.stack() is used to pivot (or stack) the columns of a DataFrame into the row index, essentially reshaping the data from a wide format to a long format.

In [91]:
stacked = df2.stack(future_stack = True)
stacked

first  second
bar    one     A   -1.004370
               B    0.268842
       two     A   -0.691180
               B    1.214667
baz    one     A   -0.993243
               B   -0.568194
       two     A    0.132516
               B   -0.053006
dtype: float64

[Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#:~:text=B%20%2D0.693205%20%201.591431-,Pivot%20tables,-%23)

In [92]:
df = pd.DataFrame(
    {
        "A":["one","one","two","three"] * 3,
        "B":["A","B","C"]*4,
        "C":["foo","foo","foo","bar","bar","bar"]*2,
        "D":np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [93]:
df

        A  B    C         D         E
0     one  A  foo -0.299426 -1.354694
1     one  B  foo  1.937269  0.578697
2     two  C  foo -0.400318  0.945432
3   three  A  bar -0.563323 -0.810218
4     one  B  bar  0.126554 -0.451542
5     one  C  bar -1.420692 -0.161733
6     two  A  foo  0.687024  1.128093
7   three  B  foo  0.495071  0.204867
8     one  C  foo -0.689797  1.739594
9     one  A  bar -0.030801  0.217912
10    two  B  bar -0.347049  0.871826
11  three  C  bar -0.364241 -0.679393

In [94]:
pd.pivot_table(df, values="D",index=["A","B"],columns=["C"])

C             bar       foo
A     B
one   A -0.030801 -0.299426
      B  0.126554  1.937269
      C -1.420692 -0.689797
three A -0.563323       NaN
      B       NaN  0.495071
      C -0.364241       NaN
two   A       NaN  0.687024
      B -0.347049       NaN
      C       NaN -0.400318

2082/05/21  06:40 PM    ,,,, @Home, Lalitpur

In [95]:
pd.pivot_table(df, values="D", index = ["A","B"], columns = ["C"])

C             bar       foo
A     B
one   A -0.030801 -0.299426
      B  0.126554  1.937269
      C -1.420692 -0.689797
three A -0.563323       NaN
      B       NaN  0.495071
      C -0.364241       NaN
two   A       NaN  0.687024
      B -0.347049       NaN
      C       NaN -0.400318

Time Series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the

In [96]:
rng = pd.date_range("1/1/2012", periods = 100 , freq = "s")
ts = pd.Series(np.random.randint(0,500, len(rng)), index=rng)
ts.resample("1Min").sum()

2012-01-01 00:00:00    15682
2012-01-01 00:01:00     9841
Freq: min, dtype: int32

In [97]:
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='s')

In [98]:
rng = pd.date_range("3/6/2012", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)), rng)

ts

2012-03-06    1.563119
2012-03-07    0.614468
2012-03-08   -0.220292
2012-03-09    0.075059
2012-03-10    0.208862
Freq: D, dtype: float64

In [99]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-06 00:00:00+00:00    1.563119
2012-03-07 00:00:00+00:00    0.614468
2012-03-08 00:00:00+00:00   -0.220292
2012-03-09 00:00:00+00:00    0.075059
2012-03-10 00:00:00+00:00    0.208862
Freq: D, dtype: float64

In [100]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00    1.563119
2012-03-06 19:00:00-05:00    0.614468
2012-03-07 19:00:00-05:00   -0.220292
2012-03-08 19:00:00-05:00    0.075059
2012-03-09 19:00:00-05:00    0.208862
Freq: D, dtype: float64

In [101]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [102]:
rng + pd.offsets.BusinessDay(5)

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)